cmsis-svd/cmsis-svd/data/Fujitsu/MB9AF13xK.xml
        <!-- REGISTER "IRQ28MON" -->
        <register>
          <name>IRQ28MON</name>
          <description>IRQ28 Batch Read Register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BTINT15" -->
            <field>
              <name>BTINT15</name>
              <description>IRQ1 interrupt request on the base timer ch.7</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT14" -->
            <field>
              <name>BTINT14</name>
              <description>IRQ0 interrupt request on the base timer ch.7</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT13" -->
            <field>
              <name>BTINT13</name>
              <description>IRQ1 interrupt request on the base timer ch.6</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT12" -->
            <field>
              <name>BTINT12</name>
              <description>IRQ0 interrupt request on the base timer ch.6</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT11" -->
            <field>
              <name>BTINT11</name>
              <description>IRQ1 interrupt request on the base timer ch.5</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT10" -->
            <field>
              <name>BTINT10</name>
              <description>IRQ0 interrupt request on the base timer ch.5</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT9" -->
            <field>
              <name>BTINT9</name>
              <description>IRQ1 interrupt request on the base timer ch.4</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT8" -->
            <field>
              <name>BTINT8</name>
              <description>IRQ0 interrupt request on the base timer ch.4</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT7" -->
            <field>
              <name>BTINT7</name>
              <description>IRQ1 interrupt request on the base timer ch.3</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT6" -->
            <field>
              <name>BTINT6</name>
              <description>IRQ0 interrupt request on the base timer ch.3</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT5" -->
            <field>
              <name>BTINT5</name>
              <description>IRQ1 interrupt request on the base timer ch.2</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT4" -->
            <field>
              <name>BTINT4</name>
              <description>IRQ0 interrupt request on the base timer ch.2</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT3" -->
            <field>
              <name>BTINT3</name>
              <description>IRQ1 interrupt request on the base timer ch.1</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT2" -->
            <field>
              <name>BTINT2</name>
              <description>IRQ0 interrupt request on the base timer ch.1</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT1" -->
            <field>
              <name>BTINT1</name>
              <description>IRQ1 interrupt request on the base timer ch.0</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT0" -->
            <field>
              <name>BTINT0</name>
              <description>IRQ0 interrupt request on the base timer ch.0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "GPIO" -->
    <peripheral>
      <name>GPIO</name>
      <description>General-purpose I/O ports</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x40033000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x740</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "PFR0" -->
        <register>
          <name>PFR0</name>
          <description>Port function setting register 0</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000001F</resetValue>
          <resetMask>0x0000E01F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PF" -->
            <field>
              <name>PF</name>
              <description>Bit15 of PFR0</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PE" -->
            <field>
              <name>PE</name>
              <description>Bit14 of PFR0</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PD" -->
            <field>
              <name>PD</name>
              <description>Bit13 of PFR0</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P4" -->
            <field>
              <name>P4</name>
              <description>Bit4 of PFR0</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P3" -->
            <field>
              <name>P3</name>
              <description>Bit3 of PFR0</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P2" -->
            <field>
              <name>P2</name>
              <description>Bit2 of PFR0</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P1" -->
            <field>
              <name>P1</name>
              <description>Bit1 of PFR0</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of PFR0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PFR1" -->
        <register>
          <name>PFR1</name>
          <description>Port function setting register 1</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0000003F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P5" -->
            <field>
              <name>P5</name>
              <description>Bit5 of PFR1</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P4" -->
            <field>
              <name>P4</name>
              <description>Bit4 of PFR1</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P3" -->
            <field>
              <name>P3</name>
              <description>Bit3 of PFR1</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P2" -->
            <field>
              <name>P2</name>
              <description>Bit2 of PFR1</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P1" -->
            <field>
              <name>P1</name>
              <description>Bit1 of PFR1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of PFR1</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PFR2" -->
        <register>
          <name>PFR2</name>
          <description>Port function setting register 2</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0000000E</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P3" -->
            <field>
              <name>P3</name>
              <description>Bit3 of PFR2</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P2" -->
            <field>
              <name>P2</name>
              <description>Bit2 of PFR2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P1" -->
            <field>
              <name>P1</name>
              <description>Bit1 of PFR2</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PFR3" -->
        <register>
          <name>PFR3</name>
          <description>Port function setting register 3</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0000FE00</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PF" -->
            <field>
              <name>PF</name>
              <description>Bit15 of PFR3</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PE" -->
            <field>
              <name>PE</name>
              <description>Bit14 of PFR3</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PD" -->
            <field>
              <name>PD</name>
              <description>Bit13 of PFR3</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PC" -->
            <field>
              <name>PC</name>
              <description>Bit12 of PFR3</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PB" -->
            <field>
              <name>PB</name>
              <description>Bit11 of PFR3</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PA" -->
            <field>
              <name>PA</name>
              <description>Bit10 of PFR3</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P9" -->
            <field>
              <name>P9</name>
              <description>Bit9 of PFR3</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PFR4" -->
        <register>
          <name>PFR4</name>
          <description>Port function setting register 4</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x000006C0</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PA" -->
            <field>
              <name>PA</name>
              <description>Bit10 of PFR4</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P9" -->
            <field>
              <name>P9</name>
              <description>Bit9 of PFR4</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P7" -->
            <field>
              <name>P7</name>
              <description>Bit7 of PFR4</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P6" -->
            <field>
              <name>P6</name>
              <description>Bit6 of PFR4</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PFR5" -->
        <register>
          <name>PFR5</name>
          <description>Port function setting register 5</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P2" -->
            <field>
              <name>P2</name>
              <description>Bit2 of PFR5</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P1" -->
            <field>
              <name>P1</name>
              <description>Bit1 of PFR5</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of PFR5</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PFR6" -->
        <register>
          <name>PFR6</name>
          <description>Port function setting register 6</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P1" -->
            <field>
              <name>P1</name>
              <description>Bit1 of PFR6</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of PFR6</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PFR8" -->
        <register>
          <name>PFR8</name>
          <description>Port function setting register 8</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P2" -->
            <field>
              <name>P2</name>
              <description>Bit2 of PFR8</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P1" -->
            <field>
              <name>P1</name>
              <description>Bit1 of PFR8</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of PFR8</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PFRE" -->
        <register>
          <name>PFRE</name>
          <description>Port function setting register E</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xB</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P3" -->
            <field>
              <name>P3</name>
              <description>Bit2 of PFRE</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P2" -->
            <field>
              <name>P2</name>
              <description>Bit1 of PFRE</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of PFRE</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
